Repository: Lilium27/Creating-Intelligent-Content-with-Lightweight-DITA-Translation-Project
Catalog: omegat/project_save.tmx
Source language: en
Languages: zh_cn

source: All three list items are valid in HTML5
zh_cn: 这三个列表项在HTML5都有效

source: Allowing learners to start immediately on meaningfully realistic tasks
zh_cn: 允许学习者立刻上手操作实际项目

source: Also, the start of each chapter includes a table of contents.
zh_cn: 此外，每一章的开始都包括一个目录。

source: Alternate text: a textual description of an image that can be read or displayed in place of the image.
zh_cn: 替代文本（alternate text）：描述图像内容的文本，

source: Although an author does not even need to be familiar with XML in order to create information products in the workflows introduced in this book, the ideas presented in Creating Intelligent Content with Lightweight DITA are rooted in DITA and XML.
zh_cn: 尽管在本书介绍的工作流中，创作者创建信息产品不需要对 XML 很熟悉，但本书的思想植根于 DITA 和 XML。

source: Although concept, task, and reference are still defined types in the DITA standard, the official specification for DITA 1.3 also includes topic types for troubleshooting, which “provides markup for corrective action information such as troubleshooting and alarm clearing” (2.7.1.6 Troubleshooting topic, 2016) and glossary, which “defines a single sense of one term” (2.7.1.7 Glossary entry topic, 2016).
zh_cn: 虽然概念（concept）、任务（task）和参考（reference）仍是 DITA 标准中定义好的类型，DITA官方规范1.3版本还包括了关于排除故障的话题类型，这些话题类型“提供编写纠正行为信息的标记，比如‘故障排除’（troubleshooting）和‘警示清除（alarm clearing）’”（2.7.1.6 话题“故障排除”（troubleshooting），2016年），还包括了术语表，术语表“定义了每个术语的含义”（2.7.1.7 话题“术语表条目”（glossary entry），2016年）。

source: Although in Chapters 5 and 6 I will further analyze the DITA tags and attributes, for the scope of this introductory section, I structured and tagged O'Keefe's recipe for marinara sauce as a DITA task (Figure 1.3).
zh_cn: 在第5章和第6章中，我将进一步分析 DITA 的标签和属性。在本部分的简介中，我会将奥基夫的马里纳拉酱料菜谱结构化，打上标签，作为一个 DITA 任务（task）话题的示范（图1.3）。

source: Although in Chapter 3 I introduced the main content components available in LwDITA, here I focus on how to represent each of those topic components in the authoring formats of XDITA, HDITA, and MDITA.
zh_cn: 在第三章中我介绍了 LwDITA 中主要的内容组件，而本章中的重点是如何用 XDITA、HDITA、MDITA写作格式表示这些主题组件。

source: Although it probably will How DITA Evolved Into LwDITA 63 not be part of a LwDITA user’s daily routine, the proposed standard allows document and element type specialization (the Darwin part of DITA) for information architects interested in creating custom structures.
zh_cn: 尽管专门化可能不会成为 LwDITA 用户日常工作的一部分，但是计划的 LwDITA标准允许将文档和元素类型专门化（DITA 名中的“Darwin”就是这个意思），供对创建特定结构感兴趣的信息架构师使用。

source: Although it probably will not be part of a LwDITA user's daily routine, the proposed standard allows document and element type specialization (the Darwin part of DITA) for information architects interested in creating custom structures.
zh_cn: 尽管专门化可能不会成为 LwDITA 用户日常工作的一部分，但是计划的 LwDITA标准允许将文档和元素类型专门化（DITA 名中的“Darwin”所指），供对创建特定结构感兴趣的信息架构师使用。

source: Although no author is expected to become an expert on all topic types and their relations, criticism in industry and, perhaps, the timid interest from academia stem from the long, and getting longer, list of types, tags, and their functions included in the DITA standard.
zh_cn: 没有写作者希望成为知晓所有话题类型及其关系的专家，工业界对 DITA 的批评以及学术界对 DITA 兴趣寥寥的原因都是 DITA 标准中本就繁杂，且正变得越来越繁杂的类型、标签、功能。

source: Although the DITA-OT is closely associated with the DITA specification, it is not a standard approved by the OASIS DITA Technical Committee and therefore should be considered as only one option for transforming DITA content.
zh_cn: 尽管DITA-OT与DITA规范密切相关，但它不是OASIS DITA技术委员会批准的标准，因此只应将其视为转换DITA内容的选项之一。

source: Although the benefits of a well-planned and implemented intelligent content workflow built on XML or DITA are undeniable, this type of solution presents significant challenges that have repercussions in the academic and workplace facets of the profession.
zh_cn: 虽然基于 XML 或 DITA 的智能内容工作流经过精心规划、部署带来的好处不可否认，但这种解决方案也带来了重大挑战，对该领域的学术研究和职场工作都产生了影响。

source: Although the concept of a simplified version of DITA XML had been around since 2011, before the spring of 2014 it all had been pretty much a side project of Michael Priestley, one of DITA's founding fathers, who still had a full-time position at IBM doing non-DITA work.
zh_cn: 尽管简化版 DITA XML 的概念早在2011年就出现了，但在2014年春天之前，它几乎算是 DITA 创始人之一迈克尔·普里斯特利的一个业余项目。当时，普里斯特利仍然是IBM的全职员工，做着与 DITA 无关的工作。

source: Although the recommendations from Cohen and Cunningham were focused on a manual that was to be presented as a book, they predicted an era “when advanced technology will enable us to use on-line documentation exclusively” (1984, p.146).
zh_cn: 尽管柯亨和坎宁安的建议集中于以书册形式呈现的手册上，但他们预测到了“先进技术将使得所有文档在线化”的时代 (1984, p.146).

source: Although there is no generally-adopted process or workflow for authoring intelligent content with DITA or LwDITA, some authors have proposed detailed models for content-development lifecycles that provide a solid foundation for
zh_cn: 尽管使用 DITA 或 LwDITA 创作智能内容并没有一个通用的工作流程，但一些作者已经提出了内容开发生命周期的详细模型，为我将在第

source: An Element for Every (Content) Occasion
zh_cn: （内容）场景需要用到的元素

source: An Important Rule About “Mixed Content” in LwDITA
zh_cn: 关于LwDITA中的“混合内容”的重要规则

source: An Introduction to XML in Technical Communication
zh_cn: 技术传播中的 XML

source: An action plan for potential franchise owners
zh_cn: 为潜在的特许经营权所有者制定的行动计划

source: An advanced option is the commercial editor Oxygen XML Editor, from Syncro Soft.
zh_cn: 来自Syncro Soft的商业编辑器Oxygen XML Editor是更高阶的选择。

source: An appropriate reaction to this urgency should separate that mandate in manageable layers of abstraction that can be addressed individually by working on a progression of activities and ideas by focusing on some concepts while ignoring others that would be revealed after completing the current layer.
zh_cn: 对于这种的紧迫情况，恰当的应对方案应该是将可处理的抽象层级中的命令与只关注某些概念的想法区分开来，前者可以通过一系列的操作逐个解决，而后者忽略了在当前层级完成之后将揭示的其他概念。professional and technical communication

source: An arcane, overly complex language with a massive learning curve that requires specialized tools.
zh_cn: 语言晦涩且过于复杂、学习曲线陡峭、需要使用特定工具的 DITA。

source: An effective topic covers only one subject.
zh_cn: 一个有效的话题只涵盖一个主题。

source: An element can be as small as a word and as large as a tutorial” (Hargis et al., 2004, p.
zh_cn: 元素可以小到一个单词，大到一个教程 (Hargis et al., 2004, p.

source: An element can be as small as a word and as large as a tutorial” (1998, p.
zh_cn: 元素可以小到一个单词，大到一个教程 (1998, p.

source: An index, which is organized alphabetically and also presented at the end of the book (Price, 1984).
zh_cn: 书的结尾还应该有按字母顺序排列的索引 (Price, 1984)。

source: An intelligent content strategy establishes a coherent plan under which content will be designed, developed and deployed so as to achieve maximum benefit to the customer and the organization while minimizing the cost to the organization.
zh_cn: 智能内容策略将建立一个条理清晰的计划，在这个计划之下设计、发开、部署内容，可以为客户和组织带来最大的利益，同时使组织的成本降到最低。

source: An optional topic component that I have addressed in previous chapters is the multipurpose short description (<shortdesc> in XDITA), which performs a staging move (see Table 2 in Chapter 2) before a topic goes into detail about a specific subject.
zh_cn: 我在前几章中提过一个可选话题组件：多用途简短描述(XDITA中的<shortdesc> )，该组件在某话题深入探讨主题细节之前进行阶段过度（参见第2章中的表2）。

source: An “increasing reluctance to read instructions, whether they are on a product, on its packaging, or in a manual.” They hypothesized that conditions like “the age of television we live in” or the bad reputation spawned by manuals of the past were to blame.
zh_cn: “无论是印在产品上、包装上或是手册上，人们都越来越不爱读说明书了。”他们都假定罪魁祸首是“我们生活的电视时代”或过去手册造成的坏名声。

source: Analysis (Examining Business Drivers).
zh_cn: 分析（检测业务驱动因素）

source: Analyzing business needs: gather business requirements, analyze content lifecycle, conduct content audit, and analyze existing content.
zh_cn: 分析业务需求：收集业务需求，分析内容生命周期，进行内容审计，分析现有内容。

source: Analyzing customer needs: gather user requirements, define personas and scenarios, and identify device constraints.
zh_cn: 分析用户需求：收集用户需求，定义用户画像和使用场景，发现设备的限制条件。

source: And I have not heard from DITA or LwDITA practitioners who used their intelligent content knowledge for tiling the kitchen floor.
zh_cn: 我还没有听过 DITA 或 LwDITA 从业人员用智能内容知识铺厨房地板的故事。

source: And authors should not underestimate
zh_cn: 作者不应该低估

source: And for occasional writers - those whose main job is something else but who are sometimes called on to produce content - structured writing can be a godsend if implemented properly.
zh_cn: 并且对于那些只是偶尔写作的创作者而言——他们的主业并非于此，只是有时应召产出内容——结构化写作如果应用得当，那简直就是神来之笔。

source: And that became our modus operandi: we would boast about the potential benefits of LwDITA in conferences and webinars, developers and managers would show interest and ask for a demo, we requested plugin updates from Elovirta and offered a new demo .
zh_cn: 这成为了我们的工作方式：我们会在各种会议和网络研讨会上夸赞 LwDITA 的潜在好处，开发人员和管理人员会表现出兴趣并要求观看演示，我们就会让艾洛维塔更新插件并提供一个新的演示

source: And that process is not about tools; actually, only a few of those layers require a computing tool, and some happen inside the author's mind before going to a computing device.
zh_cn: 这个过程与工具无关。实际上，这些层级中只有少数需要使用计算机工具，部分层级在被计算机设备处理之前是由作者的大脑构思的。

source: And that's just the task document type!
zh_cn: 这就是任务（task）文档类型！

source: And the production and update of those deliverables can be automated.
zh_cn: 这些可交付成果的产出和更新是自动化的，

source: And then the file has a few moves/ genre conventions of the introductory topic: a short description (<shortdesc>),
zh_cn: 文件有介绍性主题的一些文步/体裁惯例：一个简短的描述 (<shortdesc>),

source: And then, the conversation about an Information Mapping and DITA merger ended, and in an updated version of that presentation, Priestley did not include any mention of Information Mapping and its trademarked content types (Priestley, 2013a).
zh_cn: 就这样，关于信息映射和 DITA 合并的讨论结束了。后来普里斯特利y更新了演讲内容，没有提到任何关于信息映射的信息及其已经注册了商标的内容类型（普里斯特利， 2013年）。

source: And this mention of “at least one evolutionary branch” is an important one: the OASIS DITA technical committee remains focused on the core evolutionary branch, with DITA 2.0 in development at the time of this writing.
zh_cn: “进化分支之一”这一说法很重要，意味着：OASIS DITA 技术委员会仍然关注 LwDITA 这一核心进化分支，而在撰写本文时 DITA 标准2.0版本也正在开发中。

source: And what has techcomm poured resources into?
zh_cn: 而技术传播将资源投入了哪个领域呢？

source: And when you go to practitioner events, you don't see professors.”
zh_cn: 而当你去从业者举办的活动，你也看不到教授出席。”

source: And, as with LwDITA topics, you can specify a LwDITA map in XDITA, HDITA, or MDITA, as well as possible future authoring formats.
zh_cn: 并且，与 LwDITA 话题一样，你可以用XDITA、HDITA、MDITA 或未来可能的写作格式来编写 LwDITA 地图映射关系。

source: Andersen claims that “the era of document-based information development (ID), which has shaped all aspects of research on professional and technical communication, training, and practice since the field's inception, is coming to an end” (2014a, p.
zh_cn: 安德森称“自技术传播领域开创以来，基于文件的信息开发(ID)塑造了专业传播和技术传播、培训和实践研究的方方面面，但基于文件开发的时代要结束了” (2014a, p.

source: Andersen's framework covers the following stages and activities:
zh_cn: 安德森提出的框架涵盖了以下阶段和活动：

source: Another benefit of using an LwDITA-aware app to create content is that it will probably include the grammar files and provide validation as you type.
zh_cn: 使用支持 LwDITA 的应用程序编写内容的另一个好处是，此类应用程序可能会包含语法文件，并在你输入信息时提供验证。

source: Another child of the <step> element, <stepxmp>, gives an example of how to conduct a specific command or action.
zh_cn: <step> 元素的另一个子元素<stepxmp>给出了一个如何执行特定命令或操作的示例。

source: Appendices.
zh_cn: 附录.

source: Applying that example to the world of intelligent content, Garcia's versatile milkshake recipe represents the type of authoring process that cannot be achieved with a word processor or a presentational web platform.
zh_cn: 将这个例子应用到智能内容的世界里，加西亚提到的通用奶昔食谱的写作过程是文字处理软件或演示型网页平台所无法实现的。

source: Appropriate length to treat the topic adequately yet not require lots of scrolling (Priestley et al., 2001, p.
zh_cn: 主题长度适中，不需要大量滚动查看 (Priestley et al., 2001, p.

source: Aristotle's lack of definition is perhaps not surprising given the seemingly simple concept of “topic.” Even today we think we readily understand what is meant by a “topic”: We know that the “topic” of a conversation, for example, is that thing upon which the conversation hinges.
zh_cn: 考虑到“主题”这一概念看似简单，亚里士多德未对其做出定义并不令人惊讶。即使在今天，我们仍然认为自己很容易理解“话题”的含义：例如，我们知道对话视“话题”而定。

source: As I mentioned in Chapter 1, according to Rockley et al.
zh_cn: 正如我在第一章中提到的，根据罗克利等人的观点，

source: As I write this chapter, the DITA Technical Committee at OASIS is working on the release of DITA 2.0 as a new standard parallel to LwDITA.
zh_cn: 在我撰写这一章时，OASIS 的 DITA 技术委员会正在致力于开发 DITA 标准 2.0版本，将其作为与 LwDITA 并行的新标准。

source: As Priestley's original proposal from on March 20, 2012 established, that adjective was applied to the framework that presented LwDITA as a lighter option compared to full DITA XML.
zh_cn: 随着普里斯特利在2012年3月20日提出的提案的确立，“轻量级”这个形容词可以用于形容 LwDITA 框架，与完整版 DITA XML 相比，LwDITA 是一个更加轻量的选择。

source: As a franchise owner, he wants to ensure that the food in his restaurants is consistent, and his kitchen staff needs up-to-date documentation with recipes and techniques adopted in all of his restaurants.
zh_cn: 作为餐馆老板，他希望能够确保所有餐馆里的食物是一致的，厨房员工也需要知晓佩德罗所有餐馆的最新菜谱和采用的技艺。

source: As a pair of rapidly animated hands assembles Lego pieces (Figure 1.1), the video's narrator describes that “for some, (the future of technical
zh_cn: 视频播放到一双快速活动的手组装乐高积木的画面时（图 1.1）， 响起了旁白:“对于某些人来说（技术

source: As a proposed standard for authoring and publishing content that includes technical communication, Lightweight DITA shares a common ancestor with the computer manual of the past.
zh_cn: 作为编写和出版内容（包括技术传播）的一种建议标准，轻量级DITA与以往的计算机手册同根同源。

source: As a result, HDITA topics need both a title (<title>) element and a heading 1 () element to signal the document's first heading.
zh_cn: 因此，HDITA主题不仅需要标题 (<title>) 元素，还需要一级标题() 元素来表示文档内容中的第一个标题。

source: As a result, I cannot leave out working definitions and background for context when introducing the standard and its evolution as a problem-solving methodology for technical communication.
zh_cn: 因此，在介绍 DITA 标准及其如何演变为技术传播的解决方案时，我无法忽略工作定义和上下文背景的重要性。

source: As a result, he went back to Carroll's original writing in The Nurnberg Funnel and found “the prototypical example, the user guide that Carroll used to test out the principles.” He discovered that “you could write that user guide in DITA today.
zh_cn: 因此，他回到卡罗尔的原作《纽伦堡漏斗》中寻找答案，发现“典型的例子就是，卡罗尔用用户指南来测试这些原则，而如今你可以用DITA来撰写用户指南。”

source: As a result, it becomes very easy for a user to find exactly the information that he is looking for” (1976, p.
zh_cn: 因此，用户可以很容易准确地找到他想要的信息。” (1976, p.

source: As an alternative, you can enter the keyboard shortcut of Ctrl + Shift + T (for Windows) or Command + Shift + T (for macOS).
zh_cn: 你也可以选择输入键盘快捷键 Ctrl + Shift + T (Windows) 或Command + Shift + T (for macOS) 来完成上述操作。

source: As many levels of documentation are required as there are levels of users.” Technique was connected to the budget and quality of documentation: “Two elements of documentation are indispensable 一 integration with the system implementation and on-line machine-readable generation” (Patterson, 1975, p.
zh_cn: “用户的级数决定了文档的层数。”技术与文档的预算和质量密切相关：“文档有两大元素不可或缺——与系统实现实现整合、在线生成且机器可读。”(Patterson, 1975, p.

source: As of summer 2018, the list included 724 companies, excluding consulting and training firms (DITAWriter, n.d.).
zh_cn: 截至2018年夏季，除咨询和培训公司外，该名单包括724家公司 （DITAWriter，未注明日期）。

source: As presented in that introductory paper, a DITA-based solution for developing structured information consisted of the following three parts:
zh_cn: 正如在那篇介绍性文章中所介绍的，用于开发结构化信息的基于DITA的解决方案由以下三个部分组成:

source: As the Scriptorium video “Testing the DITA Open Toolkit” shows, the easiest way to record the correct file location or path is to drag and drop the file into the command line interface immediately after the --input= argument.
zh_cn: 正如 Scriptorium 视频“测试DITA Open Toolkit”所示，记录正确的文件位置或路径的最简单的方法是在输入--input= 某个参数之后立即将文件拖放到命令行界面中。

source: As those DITA fixed templates for topics and their structures at the section, paragraph, sentence, or even word level became widely used within IBM, the structures moved to the organizational or institutional category.
zh_cn: 随着DITA各主题固定模板以及章、段、句、甚至词级别结构在IBM内部广泛使用，这些结构转向组织机构类别

source: As we will frequently see when examining the LwDITA map and topic components, the MDITA syntax is by far the easiest of the three initial authoring formats.
zh_cn: 正如我们在观察 LwDITA 地图和话题组件时经常发现的那样，MDITA 语法是到目前为止三种最初的写作格式中最简单的。

source: At its core, HDITA uses some HTML5 elements and attributes (particularly custom data attributes) to reproduce some of the content structuring, reuse, and publishing capabilities of DITA without depending on XML.
zh_cn: HDITA的核心会使用一些HTML5元素和属性(特别是自定义数据属性)来再现DITA的一些内容结构、复用和发布功能，而不依赖于XML。

source: At its core, XDITA is a simplified version of DITA, with a limited set of elements (tags) and options but similar capabilities for content structure, reuse, and publication.
zh_cn: XDITA的核心是DITA的简化版本，只有一组有限的元素(标记)和选项，但在内容结构、重用和发布方面具有类似的功能。

source: At one point, Michael Priestley talked about an audience of people who have an aversion to XML or existing DITA work- flows.
zh_cn: 迈克尔·普里斯特利曾经谈到过讨厌 XML 或现有 DITA 工作流的用户。

source: At one point, Michael Priestley talked about an audience of people who have an aversion to XML or existing DITA workflows.
zh_cn: 迈克尔·普里斯特利曾经谈到过讨厌 XML 或现有 DITA 工作流的用户。

source: At professional conferences, I occasionally engage in nostalgic conversations with colleagues who continue to state the claim that content developers and their readers lost something when the manual disappeared.
zh_cn: 在专业会议上，我偶尔会和同事们一起缅怀从前，他们不断地宣扬手册消失后内容开发者及读者丢失了一些东西。

source: At that session on April 16, 2013 Priestley's slides for the talk “Lightweight DITA: A preview of the DITA 1.3 feature” included the 12 content types and quietly foretold the merger of content types from Information Mapping and DITA in LwDITA.
zh_cn: 在2013年4月16日的会议上，普里斯特利为“轻量级 DITA：DITA 标准1.3版本的特性”做了演讲，幻灯片包含了12种内容类型，并悄悄预言了 LwDITA 融合了信息映射中和 DITA 中的内容类型。

source: At the same time, HTML5 had been released with enhanced semantic tags and capabilities for extended attributes that could replicate fundamental structuring and publishing features of DITA XML.
zh_cn: 与此同时，HTML5 发布了更强大的语义标签，增强了扩展属性的能力，这些扩展属性可以复刻 DITA XML 的基本结构和发布特性。

source: At the same time, and in a more tongue-in-cheek fashion, Carroll has also been labeled as “the man who killed the manual” (Svenvold, 2015).
zh_cn: 同时有戏言称，卡罗尔可以称得上是“消灭手册的人”。(Svenvold, 2015).

source: At the same time, he said any system that traps you into a fixed pattern or template can be detrimental if the content doesn't fit that pattern or template.
zh_cn: 与此同时，他也表示如果内容与模式模板不相适却还强制你使用那一套固定的模式或模板，这样的系统是有害的。

source: At the same time, the menus in his restaurants need to reflect some of that content, which is also featured on a website, mobile app, and an electronic book he sells describing the history and process of his restaurants.
zh_cn: 与此同时，餐馆菜单需要反映一些网站、移动软件、介绍餐馆历史和发展过程的电子书上的内容。

source: At the topic level, and without getting too deep into the process of DITA specialization, just as <concept> and <task> are specialized from the original generic <topic>, <task> could specialize into <recipe>.
zh_cn: 在不深入讨论如何定制 DITA 话题的情况下，我们来看一下各种话题。 <concept> 和<task> 是为最初通用的 <topic> 特别定制的，而为 <task> 又再具体定制了 <recipe>。

source: At this point we still won't have any actual topics with content; however, you can download these sample files from the Creating Intelligent Content with Lightweight DITA GitHub repository (https://github.com/carlosevia/ lwdita-book) and generate deliverables following the steps and examples from this chapter.
zh_cn: 所以目前我们没有包含内容的实际话题。但是你可以从 Creating Intelligent Content with Lightweight DITA GitHub 仓库 (https://github.com/carlosevia/ lwdita-book) 下载这些样本文件，并按照本章中的步骤和示例生成交付物。

source: At this point, an author new to structured content should resist the urge to preview the topic in a deliverable.
zh_cn: 一个刚接触结构化内容写作的创作者应该遏制住在交付文件中预览话题的冲动。

source: Audio: a link to sound to be included in the content.
zh_cn: 音频（audio）：内容中包含的音频链接。

source: Authors are in charge of the abstractions behind the code and content that provides the backbone for intelligent content.
zh_cn: 创作者负责将代码和内容转换为抽象概念，而这些抽象概念为智能内容提供了主干。

source: Authors can participate in automation by writing a script or application to filter content.
zh_cn: 创作者可以通过编写脚本或应用程序来过滤内容，从而参与自动化的过程。

source: Authors coming to XDITA from HTML5 might find that unusual, but this can simplify content reuse in more advanced situations.
zh_cn: 从 HTML5 转到 XDITA 的创作者可能会觉得这有些奇怪，但这可以在更复杂的情况下简化内容复用过程。

source: Authors do not need special software tools to create content in DITA; however, they will need a software processor to transform DITA topics into deliverables for human users.
zh_cn: 创作者利用 DITA 创建内容不需要使用特殊的软件工具，但是他们需要软件工具来将 DITA 话题转换为人类用户可以阅读的交付物。

source: Authors who want their XML content to be subsumed by a content set based on HTML5 or Markdown
zh_cn: 希望在基于HTML5或Markdown的内容集中包含XML内容的作者

source: Authors who want to write simple content for the web that does not require a transformation process
zh_cn: 希望为web编写简单内容而无需进行转换的作者

source: Authors with previous DITA or HTML experience question why the list item must include a paragraph to hold its content.
zh_cn: 有DITA或HTML经验的作者会问，为什么列表项必须包含一个段落来容纳其内容。

source: Automation can be used to minimize the time, effort and money needed to apply a good content strategy.
zh_cn: 自动化内容可以用来最小化执行内容策略所需的时间、精力和金钱。

source: Automation is then provided by software applications, be it a commercial product like Adobe FrameMaker or an open source implementation of DITA.
zh_cn: 自动化功能是由软件应用程序提供的，如 Adobe FrameMaker 这样的商业产品，或者 DITA 这样的开源产品。

source: Automation “is the mapping of computation to physical systems that perform them” (Perkovic et al., 2010, p.
zh_cn: 自动化“就是将计算机命令映射到执行这些命令的物理系统上” (Perkovic et al., 2010, p.

source: Autoplay: determines if a multimedia component should play automatically on a deliverable.
zh_cn: 自动播放（autoplay）：控制交付物上的多媒体组件是否应该自动播。

source: BEFORE INTELLIGENT CONTENT, THERE WAS THE COMPUTER MANUAL
zh_cn: 智能内容出现前,计算机手册占据主导

source: Back in 2004, David Dayton identified “two major fault lines” creating tension in the profession of technical communication: one between academics and practitioners, and another among academics, with a camp focusing on rhetorical generalism and another identifying
zh_cn: 早在2004年，大卫·代顿就提出了“两大断层线”的想法，在技术传播领域制造了紧张气氛：一个断层线在学者和从业者之间，另一个断层线在学术界内部：一个阵营关注一般性修辞，

source: Bailie & Urbina emphasize that their model is software-agnostic (“The stages of the lifecycle address a comprehensive set of issues that must be addressed no matter what software is adopted”), extensible (“The cycle is not limited to content within a silo, whether a departmental silo or genre silo), and iterative (“Content lives on through multiple iterations, whether the iteration is a translation, a revision, or other type of variant”) (2013, p.
zh_cn: 拜利和厄比纳强盗他们的模型与软件无关（“无论采用什么软件，生命周期的各个阶段会处理一系列必须要处理的综合问题”），是可扩展的（“生命周期并不局限于某一个存储库里的内容，不管是是部门存储库还是类型存储库都适用”），可迭代的（“内容通过多次迭代保持活力，迭代方式包括翻译、修订以及其他变体”）(2013, p.

source: Bailie & Urbina's content lifecycle model, for example, is built on a structure of four quadrants that represent the stages of 1) analysis, 2) collection, 3) management, and 4) publication (which includes “post-publication maintenance”) followed by a loop back to analysis for the next cycle.
zh_cn: 例如，拜利和厄比纳提出的内容生命周期模型构建在一个四象限结构上，四个象限分别表示以下阶段：1）分析、2）聚合、3）管理和4）发布（包括“发布后的维护”阶段），经历完四个阶段后再从头分析，为下一个生命周期做准备。

source: Based on conversations with former and current IBM employees, I determined that the technical communicator could be Susan Carpenter, who is now a senior manager of technical documentation at Red Hat and “led the first pilot of DITA with IBM WebSphere Application Server docs” (DITAWriter, 2016).
zh_cn: 根据与IBM前任和在职员工的交流，我认定那位技术传播工程师就是苏珊·卡朋特（Susan Carpenter），如今她是红帽公司技术文档部门的高级经理，并“曾用DITA撰写IBM公司WebSphere Application Server（WAS）的相关文档，引领了首次试点。” (DITAWriter, 2016).
